tutorials/viscoelastic/viscoelasticFluidFoam/PTT-Exponential/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * /

/*
From:
VERBEETEN, W. M. H.; PETERS, G. W. M.; BAAIJENS, F. P. T. Viscoelastic analysis
of complex polymer melt flows using the extended pom-pom model. Journal
of Non-Newtonian Fluid Mechanics, v. 108, n. 1-3, p. 301-326, 2002.

Table 1
Linear and non-linear parameters for fitting of the DSM Stamylan LD 2008 XC43 LDPE melt
i  Maxwell parameters  Exponential PTT
   Gi (Pa)   li (s)     epi    zei
1  7.2006e4  3.8946e-3  0.30   0.08
2  1.5770e4  5.1390e-2  0.20   0.08
3  3.3340e3  5.0349e-1  0.02   0.08
4  3.0080e2  4.5911e0   0.02   0.08
Tr = 170 C; activation energy: E0 = 48.2 kJ/mol; WLF-shift parameters: C1 = 14.3K, C2 = 480.8K.
*/

rheology
{

        type multiMode;

        models
        (
                first
                {
                type PTT-Exponential;
                rho              rho [1 -3 0 0 0 0 0] 850;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
                etaP             etaP [1 -1 -1 0 0 0 0] 280.43457;
                lambda           lambda [0 0 1 0 0 0 0] 3.8946e-3;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.3;
                zeta             zeta [0 0 0 0 0 0 0] 0.08;
                }

                second
                {
                type PTT-Exponential;
                rho              rho [1 -3 0 0 0 0 0] 850;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
                etaP             etaP [1 -1 -1 0 0 0 0] 810.4203;
                lambda           lambda [0 0 1 0 0 0 0] 5.1390e-2;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.2;
                zeta             zeta [0 0 0 0 0 0 0] 0.08;
                }

                third
                {
                type PTT-Exponential;
                rho              rho [1 -3 0 0 0 0 0] 850;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
                etaP             etaP [1 -1 -1 0 0 0 0] 1678.6357;
                lambda           lambda [0 0 1 0 0 0 0] 5.0349e-1;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.02;
                zeta             zeta [0 0 0 0 0 0 0] 0.08;
                }

                fourth
                {
                type PTT-Exponential;
                rho              rho [1 -3 0 0 0 0 0] 850;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
                etaP             etaP [1 -1 -1 0 0 0 0] 1381.0029;
                lambda           lambda [0 0 1 0 0 0 0] 4.5911e0;
                epsilon          epsilon [0 0 0 0 0 0 0] 0.02;
                zeta             zeta [0 0 0 0 0 0 0] 0.08;
                }
      );

}

// ************************************************************************* //
